simulacoes/hartmann/mhdCentralFoam/Ha=20/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                    none;
    div(tauMC)                 Gauss linear;
    //div(phiB,((2*DBU)*B))      Gauss linear;
    //div(phiB,(EDB*B))          Gauss linear;
    //div(div(BB))               Gauss linear;
    //div(phiB,((2*DBU)*(B&U)))  Gauss linear;
    //div(phiB,U)                Gauss linear;
    //div(phiInc,B)              Gauss linear;
    //div(phiInc,KB)             Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) vanLeer;
    reconstruct(U)   vanLeerV;
    reconstruct(T)   vanLeer;
    reconstruct(B)   vanLeerV;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
